[
    {
        "author": "HidamaO_O",
        "content": "An absolute masterclass in producing an enjoyable action movie. Cinematography was great, the story was paced extremely well, and the casting of ALL roles was absolutely perfect.\r\n\r\nCruise, Pegg and Rhames were awesome as always, Whigham and Davis were great additions, but the power quartet of Ferguson, Atwell, Klementieff and Kirby, really went above and beyond in making this movie perfect. Not to mention the chilling confidence of Morales as Gabriel, who practically oozed tangible danger.\r\n\r\nFrom the pre-opening credits scene to the final act, you will be on the edge of your seat - especially during any fight scene that involves Ferguson or Klementieff - and whilst there are moments that the tempo slows down to advance the story, it is always completely captivating.\r\n\r\nThe single, solitary, disappointment comes as the credits roll, and you remember you're going to have to wait until next year to see how it ends.",
        "created_at": "2023-07-08T14:22:10.705Z",
        "id": "64a971123e2ec800cbcd3af9",
        "MovieId": 575264
    },
    {
        "author": "The Movie Mob",
        "content": "**Mission: Impossible - Dead Reckoning (Part One) boasts some of cinema's most stunning stunt work, but it came at the cost of character development and a solid story.**\r\n\r\nMan…. I wish I loved this movie more than I did. Don't get me wrong, it's a solid action movie with jaw-dropping stunts (some of the best in the series), but as a Mission: Impossible movie, it felt like a small step backward for the franchise. Fallout had mind-blowing action sequences and stunt work, along with developing Ethan's relationship with Ilsa, providing closure with Julia, showing the lengths Ethan would go to protect those closest to him, and battling an imposing villain. Dead Reckoning: Part One stretches the movie across two films only to seemingly showcase action spectacle after action spectacle while sacrificing character development. Characters I have grown to love over a decade of films felt sidelined, ignored, or wasted. Hayley Atwell's new character chewed up most of the screen time, and while she was fantastic, I wanted to see more of the original team. The new villain had an inconsistent ability that confused more than intimidated. There were some important emotional moments that I just didn't feel the weight of when I definitely should have. Part Two might tie everything together and make me enjoy Part One more in retrospect, but unfortunately, I left wanting more from this one.",
        "created_at": "2023-07-12T05:24:21.317Z",
        "id": "64ae3905d6590b00c7acf53f",
        "MovieId": 575264,
        "rating": 7.0
    },
    {
        "author": "Manuel São Bento",
        "content": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-mi-dead-reckoning-part-one-is-a-summer-blockbuster-in-its-purest-form/\r\n\r\n\"Mission: Impossible - Dead Reckoning Part One delivers precisely what it set out to do: stunningly frenetic, relentless on-location action with adrenaline-charged energy levels. A 163-minute runtime rarely feels this light, thanks to the contributions of the sublime cast – Hayley Atwell is outstanding – and the truly memorable score that elevates all the otherworldly set pieces.\r\n\r\nIt has the \"problem\" of being the first of two parts, with some unnatural, repetitive exposition scenes that get in the way of its progress, in addition to a somewhat generic, ambiguous narrative around A.I.\r\n\r\nNevertheless, it's a summer blockbuster in its purest form, as you'd expect from the icon Tom Cruise, to whom we owe our allegiance.\"\r\n\r\nRating: A-",
        "created_at": "2023-07-15T19:26:52.558Z",
        "id": "64b2f2fcc8a2d400e3933e94",
        "MovieId": 575264,
        "rating": 8.0
    },
    {
        "author": "bradley",
        "content": "FNAF was great, Kinda wish it had blood, Every kill was offscreen or really dark and you cant really see the kill.",
        "created_at": "2023-10-26T11:17:37.038Z",
        "id": "653a4ad08a0e9b010b29016c",
        "MovieId": 507089,
        "rating": 9.0
    },
    {
        "author": "MustachedMovieMan",
        "content": "I don't really get what all the negative reviews are about.\r\nIt's not the best movie ever or that I've seen this year, but I still had a good time watching it. The story was interesting, it had some scary parts, some humorous parts, lots of tension, was well-acted, well-shot, and the effects (both practical and CGI) were well-done. Also, the production design and creature design was great.\r\n\r\nA movie doesn't have to be restricted to either being \"the best\" or \"horrible.\" The theater I saw it in was packed, the audience was responsive and seemed to be loving it, and I myself enjoyed it.\r\n\r\nI didn't really play the games, but I was definitely engaged in the lore of some of the MatPat Game Theory videos I saw. And I could tell from audience reactions that there were some cool things in the movie if you knew the games. That's not a negative, to be clear. It's always really cool when filmmakers put things in movies that true fans would catch and geek-out about.\r\n\r\nAs far as being a viewer who didn't really play the games, I enjoyed the movie. And while I think knowing the games/lore would have definitely enhanced my enjoyment and enthusiasm, I wouldn't say it lacks as a movie or that the games are \"required viewing\" for those who haven't played them. Everything's explained pretty well.\r\n\r\nAs far as the horror aspect goes, it is PG-13; I saw some reviews complaining about the lack of gore... It's PG-13. C'mon guys.\r\nBut, that being said, I thought they still did a good job with the horror elements that were present.\r\n\r\nI also really liked the trio of main characters. I thought Josh Hutcherson, Piper Rubio, and Elizabeth Lail all did a good job.\r\nAlso, I'm glad Josh Hutcherson is back. I hope he'll continue to be in more movies.",
        "created_at": "2023-10-27T19:10:26.626Z",
        "id": "653c0b22564ec700e5fa4168",
        "MovieId": 507089,
        "rating": 7.0
    },
    {
        "author": "CinemaSerf",
        "content": "Didn't Josh Hutcherson used to be famous? Well here he is reduced to the role of the struggling brother of \"Abby\" (Piper Rubio). Their aunt (Mary Stuart Masterson) is determined that this hapless bag of bones isn't fit to look after the young girl - after he takes out a visiting father in the fountain of a shopping mall and gets fired; so \"Mike\" has to get another job! Opportunities are thin on the ground, but there is a vacancy doing the security night shift and an old, derelict, pizza parlour. How hard can it be? Well a meeting with the enigmatic police officer \"Vanessa\" (Elizabeth Lail) should have rung alarm bells, and when he has to take \"Abby\" there for one overnight shift - well it's soon clear that this place has secrets to keep and that it knows how to manipulate the hopes and fears of \"Mike\" and his sister. Can they stay sane and focussed long enough to survive this maze of malevolent mechanical bunnies? I'm afraid the presence of Matthew Lillard never helps a film, and here is no different - this is just a rather nonsensical attempt at a spooky mystery that certainly has nothing to make you jump. Rubio is actually quite decent, but there's isn't enough else happening to compensate for the very slow build up, surfeit of dialogue and frankly rather silly underlying premiss. I suppose as Halloween gets bigger and bigger, we are going to get more and more of these mediocre offerings - but despite it's more prominent cast, this just belongs on the Horror channel at 2am.",
        "created_at": "2023-11-02T09:34:31.341Z",
        "id": "65436d2741a561336b763051",
        "MovieId": 507089,
        "rating": 5.0
    },
    {
        "author": "EmmanuelGoldstein",
        "content": "As someone who was a victim of child sexual abuse myself and as someone who admittedly likes Trump (who praised this movie to no end) and also as a tiny bit of conspiracy nut and seeing all the mainstream media attack this movie and trying to smear it, I really, REALLY wanted to like and support and even praise this movie - but I just can't.\r\n\r\nI have to admit that it's a bit difficult for me to agree with the mainstream media's warning about this movie, but they really are correct for once - sometimes they throw you curve balls like that. I mean after all, there was a time when I trusted the mainstream media and I lost trust in them not because they were mainstream, but because they just started to get a lot of things wrong. But that also means that if they get things right for once, I can't just categorically disagree with them.\r\n\r\nAnd it's really not like they are just smearing this movie for no good reason. They do (for the most part) have a valid point. This movie does nothing to actually stop this crime or to help the victims or to help people recognize this crime when they see it. On the contrary, because it claims to be based on true events, it causes people to have a completely wrong impression about this and therefore makes it harder for people to detect it when it's happening, because this movie is less accurate in its depiction of the real world than a Liam Neeson action thriller. Actually, Liam Neeson's recent film \"Memory\" was pretty good and actually much more accurate in it's depiction of child trafficking than this movie.\r\n\r\nBecause this movie really does nothing but reinforce outdated and completely wrong stereotypes. This type of thing isn't something that mainly happens in South America or in \"other\" countries and children don't just get kidnapped out of the blue by complete strangers and against their will. The sad truth is that most cases don't involve a stranger at all, but someone the child trusts and the child isn't gonna come running to you begging for help, cause the truth is they are victims of years of extremely systematic and sophisticated psychological manipulation.\r\n\r\nAnd the perpetrators aren't all tough guys either. Actually a lot of them are quite educated, sophisticated and female because they don't raise suspicion. And also it's not just about forcing the kids to make movies - that only plays a very, very small part, but this movie would have you believe that that's the main part - that's the smallest part by far! Most of the aspects involved are MUCH worse than \"just\" that. \r\n\r\nAnd as much as I would love to think that there are plenty of officers (official or rogue) of government security agencies who are incorruptible and ceaselessly fight the \"bad guys\" in relentless sting operations, the reality sadly isn't as clear cut. Yes, sometimes SOME children do get rescued, but actually very rarely by police, much less government security agencies. Well, there was that ONE case in Bosnia where a policewoman and member of an international agency uncovered a human trafficking operation - but then again the people running it were her colleagues...",
        "created_at": "2023-07-28T00:22:40.036Z",
        "id": "64c30a506331b200ff0a64d7",
        "MovieId": 678512,
        "rating": 1.0
    },
    {
        "author": "Wuchak",
        "content": "**_Sorta “Taken 4,” but starring Jim Caviezel and focusing on children enslaved by sex traffickers_**\r\n\r\nA Homeland Security agent (Caviezel) in SoCal tracks down people involved in child pornography, but he decides to leave the agency to save children trapped in sex slavery, starting with a little boy from Honduras. He teams-up with a former cartel accountant (Bill Camp) to track down the kid’s sister in which he must eventually infiltrate a camp of Columbian revolutionaries in the Amazon jungle.\r\n\r\nMade in 2018 but not released until 2023, “Sound of Freedom” is based on the real-life story of Tim Ballard, the founder of Operation Underground Railroad (O.U.R.). It features actual footage of children being captured by slavers on CCTV. Imagine a more gritty-realistic version of the “Taken” movies, with Liam being replaced by Caviezel, and that’s this film.\r\n\r\nThis is a well-done, eye-opening picture about the perverted human cockroaches amongst us, but it isn’t entertaining in the conventional sense for obvious reasons. It amusingly became anathema to Lefties, also for obvious reasons.      \r\n\r\nThe flick runs 2 hours, 11 minutes, and was shot in Cartagena, Colombia with additional scenes done in Calexico, California.\r\n\r\nGRADE: B-",
        "created_at": "2023-08-11T03:31:53.597Z",
        "id": "64d5aba9db4ed6011c4b7184",
        "MovieId": 678512,
        "rating": 6.0
    },
    {
        "author": "CinemaSerf",
        "content": "Though at times I felt luck played a bit too much of an hand in this drama, it's still quite a potent telling of the story of dedicated real-life agent Tim Ballard (Jim Caviezel) who spent much of his time working for the US Government trying to thwart the activities of people traffickers. More specifically, of those odious and venal monsters who kidnap and trade in young children who are destined to populate the sex industry and end up drug addicts and diseased in the process. When he rescues a young boy from such a scenario, he discovers that his sister was also taken - and the youngster and his father implore Ballard to try to find her too. Impossible, you might think - but a lucky break points in the direction of a lawless area of the Colombian jungle where even the local army doesn't go. Working closely with a man with quite a murky past and now his highly useful general factotum Vampiro (Bill Camp), they head off, disguised as doctors, into the wilderness. Can he locate her? Can he rescue her and get out alive? No, there's not oodles of jeopardy about any of that - but this film really does use this seemingly impossible mission to shine a light on these disgusting practices that still thrive in ostensibly civilised, Christian societies. Cavielzel is on good form here offering us an hybrid of adventure and action coupled with a highly developed moral compass. Camp, likewise, delivers quite a charismatic effort and local copper Jorge (Javier Godino) adds an extra dimension proving that the Colombian authorities found this practice just as revolting as anyone else. It's not brutal nor particularly graphic, it just allows our own imagination to put two and two together here and is a really effective indictment of a behaviour that truly turns the stomach. From a creative perspective, the photography - especially in the jungle - is first rate and all-in-all this is a thought provoking enterprise that's well worth two hours of your time.",
        "created_at": "2023-10-19T11:59:20.700Z",
        "id": "65311a18c439c00138362a75",
        "MovieId": 678512,
        "rating": 7.0
    },
    {
        "author": "CinemaSerf",
        "content": "To be honest, there's very little new in this formulaic action adventure. It's the usual old who has got the launch codes mystery that sees Sly Stallone's \"Barney\" recruit his best mate \"Christmas\" (Jason Statham) and their lethal gang of expendables to thwart the ambitions of an unknown criminal mastermind who is hoping to arm a boat load of nuclear missiles and start WWIII. Thing is, tragedy strikes very early on in the film and \"Christmas\" is taken off the team that is sent to avenge that. Is he staying home to fester? Of course not, and lucky too - for soon he is trying to free his pals from captivity before all hell breaks loose. Plenty of pyrotechnics, a bit of contrived sexual chemistry (with Megan Fox's \"Gina\") and loads of bullets and missiles flying around keep the film moving along well enough, but the story is the thinnest of the thin; the baddie's identity is hardly a challenge to discover nor is the twist in the tale at the end remotely unexpected. Good to see that the acting colossus that is Dolph Lundgren is still getting on screen nowadays, but otherwise this really is unremarkable stuff that even the usually charismatic Statham can't really sustain.",
        "created_at": "2023-10-08T07:11:52.092Z",
        "id": "65225638ea84c7012d6ba258",
        "MovieId": 299054,
        "rating": 6.0
    },
    {
        "author": "MovieGuys",
        "content": "A B grade action flick masquerading as a A list title. That's my reaction to Expendables 4.\r\n\r\nYes, its a tired formula but at least previous Expendable films in this cheesy action franchise, showed a little genuine enthusiasm and included a  cast of well worn but also well known, action stars. \r\n\r\nBy contrast, the latest flick is easily forgettable with a good number of cast members, I've never heard of or seen on screen, infrequently. \r\n\r\nIn summary, looks and behaves like a decidedly B grade action film with a sparse sprinkling of A grade action talent. Feels too, likes its going through the motions but not really delivering, if that makes sense.",
        "created_at": "2023-10-14T08:25:12.397Z",
        "id": "652a5068358da700e3bd1a32",
        "MovieId": 299054,
        "rating": 4.0
    },
    {
        "author": "kipo",
        "content": "I love all 3 parts before this 3rd class movie. The story is classic not bad not good for this type of movies and lots of actors from the previous movies are missing, but they bring us Megan Fox and ruin everything. I hope that this will last movie in this series.",
        "created_at": "2023-10-14T19:38:27.428Z",
        "id": "652aee33ea84c700ca1090f0",
        "MovieId": 299054,
        "rating": 4.0
    },
    {
        "author": "Manuel São Bento",
        "content": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-nolans-oppenheimer-is-a-harrowing-tale-of-one-mans-life/\r\n\r\n\"Oppenheimer is a true masterclass in how to build extreme tension and suspense through fast, detailed dialogue, an insanely powerful sound production, and an equally explosive score from Ludwig Göransson. Words cannot fully describe Hoyte van Hoytema's gorgeous cinematography.\r\n\r\nIt's a harrowing, disturbing, genuinely frightening story about how one man's compulsion and political power changed the world. Cillian Murphy, Robert Downey Jr., and Emily Blunt shouldn't miss any awards ceremonies… they're absolutely superb, as are the rest of the exceptional actors involved in the movie.\r\n\r\nPacing, structure, and runtime, in addition to its quasi-documentary style and its narrative complexity, make this a difficult, heavy watch that will, for sure, leave some viewers disappointed, bored, or simply tired. Ultimately, Christopher Nolan justifies the use of the expression \"not for everyone\".\r\n\r\nRating: A-",
        "created_at": "2023-07-20T22:49:57.141Z",
        "id": "64b9ba153009aa00ad6237a4",
        "MovieId": 872585,
        "rating": 8.0
    },
    {
        "author": "fireheart92",
        "content": "**OPPENHEIMER IS \"NOT FOR EVERYONE\" AS STATED BY CHRISTROPHER NOLAN BEFORE THE RELEASE OF THE FILM HIMSELF. ** But those who have ample knowledge of physics and chemistry, this film is a masterpiece. The film takes the viewer into the mind of the \"Father of the atomic bomb\" how he thinks, how he feels with much accuracy. Nolan beautifully explains his life both on a private and professional front. The music, the sounds with each scene are top notch. The visuals of QUANTUM PHYSICS, FISSION, NUCLEAR EXPLOSION are mind-boggling. \r\n\r\nIf possible, watch it in IMAX. \r\n\r\nTHE MOVIE IS FULL OF DIALOGUES, CONVERSATIONS MOVING BACK AND FORTH IN TIMELINE. It's a historical biography with fantabulous acting by C.M., E.B., R.D.J. and more. The scenes with ALBERT EINSTEIN are just wow. A plethora of scientists(BOHR, FERMI, TELLER, HEISENBERG) of the age can be seen throughout.  There are no action scenes if you are in search of that. \r\n\r\nIT IS A CINEMATOGRAPHIC BRILLIANCE. IF U CAN'T WATCH SIENTIFIC HISTORY JUST DON'T GO.",
        "created_at": "2023-07-23T19:38:28.707Z",
        "id": "64bd81b4c390c500e59c3158",
        "MovieId": 872585,
        "rating": 10.0
    },
    {
        "author": "Brent Marchant",
        "content": "Telling the story of a larger-than-life individual truly calls for a larger-than-life film, and that’s precisely what writer-director Christopher Nolan has come up with in his latest feature outing, handily the best work of his career. Nolan’s three-hour opus about the life of Dr. J. Robert Oppenheimer (Cillian Murphy), director of the Manhattan Project (and more commonly known as the Father of the Atomic Bomb), provides viewers with a comprehensive biography of this brilliant and thoughtful yet often-inscrutable and naïve physicist who took on a patently dangerous venture that left him morally conflicted about the nature of his creation. The story, which spans several decades of the scientist’s life, chronicles his development of “the gadget” and the fallout he suffered as a consequence of his left-wing political leanings and his efforts to keep the released nuclear genie from getting out of control. The film is admittedly a little overlong and probably could have used some editing in the opening and final hour, but, in the interest of telling the whole story of Oppenheimer’s odyssey, its length is understandable (and, consequently, justifiable). The picture’s production values are all top shelf, especially its brilliant cinematography, stirring original score and superb sound quality, an element that truly leaves audiences with a bona fide visceral experience. Moreover, the narrative is skillfully and eloquently brought to life by this offering’s outstanding ensemble cast, including Murphy, Matt Damon, Tom Conti, Benny Safdie, Emily Blunt, Florence Pugh, Gary Oldman, Rami Malek, and, especially, Robert Downey Jr., who delivers a stellar, award-worthy supporting performance showing acting chops that I never knew he possessed. “Oppenheimer” is easily the best film of the summer movie season, if not all of 2023 thus far. It packs a potent punch and delivers a message that we can all never hear too often, poignantly reminding us all of the importance of not falling prey to the same Promethean burden that Oppenheimer was forced to shoulder.",
        "created_at": "2023-07-24T12:59:23.547Z",
        "id": "64be75ab0ed2ab00ff879c6b",
        "MovieId": 872585,
        "rating": 9.0
    }
]